wolfgangz2013/rt-thread/bsp/HC32F146x_STK/Libraries/CMSIS/HC32FM14/Include/HC32F146JX.h
#define bM0P_GPIO_DIR0_P06                              *((volatile unsigned int*)(0x42664018UL))
#define bM0P_GPIO_DIR0_P07                              *((volatile unsigned int*)(0x4266401CUL))
#define bM0P_GPIO_DIR1_P10                              *((volatile unsigned int*)(0x42664080UL))
#define bM0P_GPIO_DIR1_P11                              *((volatile unsigned int*)(0x42664084UL))
#define bM0P_GPIO_DIR1_P12                              *((volatile unsigned int*)(0x42664088UL))
#define bM0P_GPIO_DIR1_P13                              *((volatile unsigned int*)(0x4266408CUL))
#define bM0P_GPIO_DIR1_P14                              *((volatile unsigned int*)(0x42664090UL))
#define bM0P_GPIO_DIR1_P15                              *((volatile unsigned int*)(0x42664094UL))
#define bM0P_GPIO_DIR1_P16                              *((volatile unsigned int*)(0x42664098UL))
#define bM0P_GPIO_DIR2_P20                              *((volatile unsigned int*)(0x42664100UL))
#define bM0P_GPIO_DIR2_P21                              *((volatile unsigned int*)(0x42664104UL))
#define bM0P_GPIO_DIR2_P22                              *((volatile unsigned int*)(0x42664108UL))
#define bM0P_GPIO_DIR2_P23                              *((volatile unsigned int*)(0x4266410CUL))
#define bM0P_GPIO_DIR2_P24                              *((volatile unsigned int*)(0x42664110UL))
#define bM0P_GPIO_DIR3_P30                              *((volatile unsigned int*)(0x42664180UL))
#define bM0P_GPIO_DIR3_P31                              *((volatile unsigned int*)(0x42664184UL))
#define bM0P_GPIO_DIR3_P32                              *((volatile unsigned int*)(0x42664188UL))
#define bM0P_GPIO_DIR4_P40                              *((volatile unsigned int*)(0x42664200UL))
#define bM0P_GPIO_DIR4_P41                              *((volatile unsigned int*)(0x42664204UL))
#define bM0P_GPIO_DIR4_P42                              *((volatile unsigned int*)(0x42664208UL))
#define bM0P_GPIO_DIR4_P43                              *((volatile unsigned int*)(0x4266420CUL))
#define bM0P_GPIO_DIR4_P44                              *((volatile unsigned int*)(0x42664210UL))
#define bM0P_GPIO_DIR4_P45                              *((volatile unsigned int*)(0x42664214UL))
#define bM0P_GPIO_DIR4_P46                              *((volatile unsigned int*)(0x42664218UL))
#define bM0P_GPIO_DIR4_P47                              *((volatile unsigned int*)(0x4266421CUL))
#define bM0P_GPIO_DIR5_P50                              *((volatile unsigned int*)(0x42664280UL))
#define bM0P_GPIO_DIR5_P51                              *((volatile unsigned int*)(0x42664284UL))
#define bM0P_GPIO_DIR5_P52                              *((volatile unsigned int*)(0x42664288UL))
#define bM0P_GPIO_DIR6_P60                              *((volatile unsigned int*)(0x42664300UL))
#define bM0P_GPIO_DIR6_P61                              *((volatile unsigned int*)(0x42664304UL))
#define bM0P_GPIO_DIR6_P62                              *((volatile unsigned int*)(0x42664308UL))
#define bM0P_GPIO_DIR6_P63                              *((volatile unsigned int*)(0x4266430CUL))
#define bM0P_GPIO_DIR6_P64                              *((volatile unsigned int*)(0x42664310UL))
#define bM0P_GPIO_DIR6_P65                              *((volatile unsigned int*)(0x42664314UL))
#define bM0P_GPIO_DIR7_P70                              *((volatile unsigned int*)(0x42664380UL))
#define bM0P_GPIO_DIR7_P71                              *((volatile unsigned int*)(0x42664384UL))
#define bM0P_GPIO_DIR7_P72                              *((volatile unsigned int*)(0x42664388UL))
#define bM0P_GPIO_DIR7_P73                              *((volatile unsigned int*)(0x4266438CUL))
#define bM0P_GPIO_DIR7_P74                              *((volatile unsigned int*)(0x42664390UL))
#define bM0P_GPIO_DIR7_P75                              *((volatile unsigned int*)(0x42664394UL))
#define bM0P_GPIO_GET0_P03                              *((volatile unsigned int*)(0x4266600CUL))
#define bM0P_GPIO_GET0_P04                              *((volatile unsigned int*)(0x42666010UL))
#define bM0P_GPIO_GET0_P05                              *((volatile unsigned int*)(0x42666014UL))
#define bM0P_GPIO_GET0_P06                              *((volatile unsigned int*)(0x42666018UL))
#define bM0P_GPIO_GET0_P07                              *((volatile unsigned int*)(0x4266601CUL))
#define bM0P_GPIO_GET1_P10                              *((volatile unsigned int*)(0x42666080UL))
#define bM0P_GPIO_GET1_P11                              *((volatile unsigned int*)(0x42666084UL))
#define bM0P_GPIO_GET1_P12                              *((volatile unsigned int*)(0x42666088UL))
#define bM0P_GPIO_GET1_P13                              *((volatile unsigned int*)(0x4266608CUL))
#define bM0P_GPIO_GET1_P14                              *((volatile unsigned int*)(0x42666090UL))
#define bM0P_GPIO_GET1_P15                              *((volatile unsigned int*)(0x42666094UL))
#define bM0P_GPIO_GET1_P16                              *((volatile unsigned int*)(0x42666098UL))
#define bM0P_GPIO_GET2_P20                              *((volatile unsigned int*)(0x42666100UL))
#define bM0P_GPIO_GET2_P21                              *((volatile unsigned int*)(0x42666104UL))
#define bM0P_GPIO_GET2_P22                              *((volatile unsigned int*)(0x42666108UL))
#define bM0P_GPIO_GET2_P23                              *((volatile unsigned int*)(0x4266610CUL))
#define bM0P_GPIO_GET2_P24                              *((volatile unsigned int*)(0x42666110UL))
#define bM0P_GPIO_GET3_P30                              *((volatile unsigned int*)(0x42666180UL))
#define bM0P_GPIO_GET3_P31                              *((volatile unsigned int*)(0x42666184UL))
#define bM0P_GPIO_GET3_P32                              *((volatile unsigned int*)(0x42666188UL))
#define bM0P_GPIO_GET4_P40                              *((volatile unsigned int*)(0x42666200UL))
#define bM0P_GPIO_GET4_P41                              *((volatile unsigned int*)(0x42666204UL))
#define bM0P_GPIO_GET4_P42                              *((volatile unsigned int*)(0x42666208UL))
#define bM0P_GPIO_GET4_P43                              *((volatile unsigned int*)(0x4266620CUL))
#define bM0P_GPIO_GET4_P44                              *((volatile unsigned int*)(0x42666210UL))
#define bM0P_GPIO_GET4_P45                              *((volatile unsigned int*)(0x42666214UL))
#define bM0P_GPIO_GET4_P46                              *((volatile unsigned int*)(0x42666218UL))
#define bM0P_GPIO_GET4_P47                              *((volatile unsigned int*)(0x4266621CUL))
#define bM0P_GPIO_GET5_P50                              *((volatile unsigned int*)(0x42666280UL))
#define bM0P_GPIO_GET5_P51                              *((volatile unsigned int*)(0x42666284UL))
#define bM0P_GPIO_GET5_P52                              *((volatile unsigned int*)(0x42666288UL))
#define bM0P_GPIO_GET6_P60                              *((volatile unsigned int*)(0x42666300UL))
#define bM0P_GPIO_GET6_P61                              *((volatile unsigned int*)(0x42666304UL))
#define bM0P_GPIO_GET6_P62                              *((volatile unsigned int*)(0x42666308UL))
#define bM0P_GPIO_GET6_P63                              *((volatile unsigned int*)(0x4266630CUL))
#define bM0P_GPIO_GET6_P64                              *((volatile unsigned int*)(0x42666310UL))
#define bM0P_GPIO_GET6_P65                              *((volatile unsigned int*)(0x42666314UL))
#define bM0P_GPIO_GET7_P70                              *((volatile unsigned int*)(0x42666380UL))
#define bM0P_GPIO_GET7_P71                              *((volatile unsigned int*)(0x42666384UL))
#define bM0P_GPIO_GET7_P72                              *((volatile unsigned int*)(0x42666388UL))
#define bM0P_GPIO_GET7_P73                              *((volatile unsigned int*)(0x4266638CUL))
#define bM0P_GPIO_GET7_P74                              *((volatile unsigned int*)(0x42666390UL))
#define bM0P_GPIO_GET7_P75                              *((volatile unsigned int*)(0x42666394UL))
#define bM0P_GPIO_SET0_P03                              *((volatile unsigned int*)(0x4266800CUL))
#define bM0P_GPIO_SET0_P04                              *((volatile unsigned int*)(0x42668010UL))
#define bM0P_GPIO_SET0_P05                              *((volatile unsigned int*)(0x42668014UL))
#define bM0P_GPIO_SET0_P06                              *((volatile unsigned int*)(0x42668018UL))
#define bM0P_GPIO_SET0_P07                              *((volatile unsigned int*)(0x4266801CUL))
#define bM0P_GPIO_SET1_P10                              *((volatile unsigned int*)(0x42668080UL))
#define bM0P_GPIO_SET1_P11                              *((volatile unsigned int*)(0x42668084UL))
#define bM0P_GPIO_SET1_P12                              *((volatile unsigned int*)(0x42668088UL))
#define bM0P_GPIO_SET1_P13                              *((volatile unsigned int*)(0x4266808CUL))
#define bM0P_GPIO_SET1_P14                              *((volatile unsigned int*)(0x42668090UL))
#define bM0P_GPIO_SET1_P15                              *((volatile unsigned int*)(0x42668094UL))
#define bM0P_GPIO_SET1_P16                              *((volatile unsigned int*)(0x42668098UL))
#define bM0P_GPIO_SET2_P20                              *((volatile unsigned int*)(0x42668100UL))
#define bM0P_GPIO_SET2_P21                              *((volatile unsigned int*)(0x42668104UL))
#define bM0P_GPIO_SET2_P22                              *((volatile unsigned int*)(0x42668108UL))
#define bM0P_GPIO_SET2_P23                              *((volatile unsigned int*)(0x4266810CUL))
#define bM0P_GPIO_SET2_P24                              *((volatile unsigned int*)(0x42668110UL))
#define bM0P_GPIO_SET3_P30                              *((volatile unsigned int*)(0x42668180UL))
#define bM0P_GPIO_SET3_P31                              *((volatile unsigned int*)(0x42668184UL))
#define bM0P_GPIO_SET3_P32                              *((volatile unsigned int*)(0x42668188UL))
#define bM0P_GPIO_SET4_P40                              *((volatile unsigned int*)(0x42668200UL))
#define bM0P_GPIO_SET4_P41                              *((volatile unsigned int*)(0x42668204UL))
#define bM0P_GPIO_SET4_P42                              *((volatile unsigned int*)(0x42668208UL))
#define bM0P_GPIO_SET4_P43                              *((volatile unsigned int*)(0x4266820CUL))
#define bM0P_GPIO_SET4_P44                              *((volatile unsigned int*)(0x42668210UL))
#define bM0P_GPIO_SET4_P45                              *((volatile unsigned int*)(0x42668214UL))
#define bM0P_GPIO_SET4_P46                              *((volatile unsigned int*)(0x42668218UL))
#define bM0P_GPIO_SET4_P47                              *((volatile unsigned int*)(0x4266821CUL))
#define bM0P_GPIO_SET5_P50                              *((volatile unsigned int*)(0x42668280UL))
#define bM0P_GPIO_SET5_P51                              *((volatile unsigned int*)(0x42668284UL))
#define bM0P_GPIO_SET5_P52                              *((volatile unsigned int*)(0x42668288UL))
#define bM0P_GPIO_SET6_P60                              *((volatile unsigned int*)(0x42668300UL))
#define bM0P_GPIO_SET6_P61                              *((volatile unsigned int*)(0x42668304UL))
#define bM0P_GPIO_SET6_P62                              *((volatile unsigned int*)(0x42668308UL))
#define bM0P_GPIO_SET6_P63                              *((volatile unsigned int*)(0x4266830CUL))
#define bM0P_GPIO_SET6_P64                              *((volatile unsigned int*)(0x42668310UL))
#define bM0P_GPIO_SET6_P65                              *((volatile unsigned int*)(0x42668314UL))
#define bM0P_GPIO_SET7_P70                              *((volatile unsigned int*)(0x42668380UL))
#define bM0P_GPIO_SET7_P71                              *((volatile unsigned int*)(0x42668384UL))
#define bM0P_GPIO_SET7_P72                              *((volatile unsigned int*)(0x42668388UL))
#define bM0P_GPIO_SET7_P73                              *((volatile unsigned int*)(0x4266838CUL))
#define bM0P_GPIO_SET7_P74                              *((volatile unsigned int*)(0x42668390UL))
#define bM0P_GPIO_SET7_P75                              *((volatile unsigned int*)(0x42668394UL))
#define bM0P_GPIO_ANALOG_ADE00                          *((volatile unsigned int*)(0x4266A000UL))
#define bM0P_GPIO_ANALOG_ADE01                          *((volatile unsigned int*)(0x4266A004UL))
#define bM0P_GPIO_ANALOG_ADE02                          *((volatile unsigned int*)(0x4266A008UL))
#define bM0P_GPIO_ANALOG_ADE03                          *((volatile unsigned int*)(0x4266A00CUL))
#define bM0P_GPIO_ANALOG_ADE04                          *((volatile unsigned int*)(0x4266A010UL))
#define bM0P_GPIO_ANALOG_ADE05                          *((volatile unsigned int*)(0x4266A014UL))
#define bM0P_GPIO_ANALOG_ADE06                          *((volatile unsigned int*)(0x4266A018UL))
#define bM0P_GPIO_ANALOG_ADE07                          *((volatile unsigned int*)(0x4266A01CUL))
#define bM0P_GPIO_ANALOG_ADE08                          *((volatile unsigned int*)(0x4266A020UL))
#define bM0P_GPIO_ANALOG_ADE09                          *((volatile unsigned int*)(0x4266A024UL))
#define bM0P_GPIO_ANALOG_ADE10                          *((volatile unsigned int*)(0x4266A028UL))
#define bM0P_GPIO_ANALOG_ADE11                          *((volatile unsigned int*)(0x4266A02CUL))
#define bM0P_GPIO_ANALOG_ADE12                          *((volatile unsigned int*)(0x4266A030UL))
#define bM0P_GPIO_ANALOG_ADE13                          *((volatile unsigned int*)(0x4266A034UL))
#define bM0P_GPIO_ANALOG_ADE14                          *((volatile unsigned int*)(0x4266A038UL))
#define bM0P_GPIO_ANALOG_ADE15                          *((volatile unsigned int*)(0x4266A03CUL))
#define bM0P_GPIO_ANALOG_ADE16                          *((volatile unsigned int*)(0x4266A040UL))
#define bM0P_GPIO_ANALOG_ADE17                          *((volatile unsigned int*)(0x4266A044UL))
#define bM0P_GPIO_ANALOG_ADE18                          *((volatile unsigned int*)(0x4266A048UL))
#define bM0P_GPIO_ANALOG_ADE19                          *((volatile unsigned int*)(0x4266A04CUL))
#define bM0P_GPIO_ANALOG_ADE20                          *((volatile unsigned int*)(0x4266A050UL))
#define bM0P_GPIO_ANALOG_ADE21                          *((volatile unsigned int*)(0x4266A054UL))
#define bM0P_GPIO_ANALOG_ADE22                          *((volatile unsigned int*)(0x4266A058UL))
#define bM0P_GPIO_ANALOG_ADE23                          *((volatile unsigned int*)(0x4266A05CUL))
#define bM0P_GPIO_SPS_SUBCS0                            *((volatile unsigned int*)(0x4266B000UL))
#define bM0P_GPIO_SPS_SUBCS1                            *((volatile unsigned int*)(0x4266B004UL))
#define bM0P_GPIO_SPS_MAINCS0                           *((volatile unsigned int*)(0x4266B008UL))
#define bM0P_GPIO_SPS_MAINCS1                           *((volatile unsigned int*)(0x4266B00CUL))
#define bM0P_GPIO_FN_SEL00_NMIS                         *((volatile unsigned int*)(0x4266C000UL))
#define bM0P_GPIO_FN_SEL00_CROUTE0                      *((volatile unsigned int*)(0x4266C004UL))
#define bM0P_GPIO_FN_SEL00_CROUTE1                      *((volatile unsigned int*)(0x4266C008UL))
#define bM0P_GPIO_FN_SEL00_SWDEN                        *((volatile unsigned int*)(0x4266C020UL))
#define bM0P_GPIO_FN_SEL01_PWM00E0                      *((volatile unsigned int*)(0x4266C080UL))
#define bM0P_GPIO_FN_SEL01_PWM00E1                      *((volatile unsigned int*)(0x4266C084UL))
#define bM0P_GPIO_FN_SEL01_PWM01E0                      *((volatile unsigned int*)(0x4266C088UL))
#define bM0P_GPIO_FN_SEL01_PWM01E1                      *((volatile unsigned int*)(0x4266C08CUL))
#define bM0P_GPIO_FN_SEL01_PWM02E0                      *((volatile unsigned int*)(0x4266C090UL))
#define bM0P_GPIO_FN_SEL01_PWM02E1                      *((volatile unsigned int*)(0x4266C094UL))
#define bM0P_GPIO_FN_SEL01_PWM03E0                      *((volatile unsigned int*)(0x4266C098UL))
#define bM0P_GPIO_FN_SEL01_PWM03E1                      *((volatile unsigned int*)(0x4266C09CUL))
#define bM0P_GPIO_FN_SEL01_PWM04E0                      *((volatile unsigned int*)(0x4266C0A0UL))
#define bM0P_GPIO_FN_SEL01_PWM04E1                      *((volatile unsigned int*)(0x4266C0A4UL))
#define bM0P_GPIO_FN_SEL01_PWM05E0                      *((volatile unsigned int*)(0x4266C0A8UL))
#define bM0P_GPIO_FN_SEL01_PWM05E1                      *((volatile unsigned int*)(0x4266C0ACUL))
#define bM0P_GPIO_FN_SEL01_EMII0C                       *((volatile unsigned int*)(0x4266C0B0UL))
#define bM0P_GPIO_FN_SEL01_EMII0S                       *((volatile unsigned int*)(0x4266C0C0UL))
#define bM0P_GPIO_FN_SEL01_EXCK0S                       *((volatile unsigned int*)(0x4266C0C8UL))
#define bM0P_GPIO_FN_SEL02_TIOA0E0                      *((volatile unsigned int*)(0x4266C108UL))
#define bM0P_GPIO_FN_SEL02_TIOA0E1                      *((volatile unsigned int*)(0x4266C10CUL))
#define bM0P_GPIO_FN_SEL02_TIOB0S0                      *((volatile unsigned int*)(0x4266C110UL))
#define bM0P_GPIO_FN_SEL02_TIOB0S1                      *((volatile unsigned int*)(0x4266C114UL))
#define bM0P_GPIO_FN_SEL02_TIOB0S2                      *((volatile unsigned int*)(0x4266C118UL))
#define bM0P_GPIO_FN_SEL02_TIOA1S0                      *((volatile unsigned int*)(0x4266C120UL))
#define bM0P_GPIO_FN_SEL02_TIOA1S1                      *((volatile unsigned int*)(0x4266C124UL))
#define bM0P_GPIO_FN_SEL02_TIOA1E0                      *((volatile unsigned int*)(0x4266C128UL))
#define bM0P_GPIO_FN_SEL02_TIOA1E1                      *((volatile unsigned int*)(0x4266C12CUL))
#define bM0P_GPIO_FN_SEL02_TIOB1S0                      *((volatile unsigned int*)(0x4266C130UL))
#define bM0P_GPIO_FN_SEL02_TIOB1S1                      *((volatile unsigned int*)(0x4266C134UL))
#define bM0P_GPIO_FN_SEL02_TIOA2E0                      *((volatile unsigned int*)(0x4266C148UL))
#define bM0P_GPIO_FN_SEL02_TIOA2E1                      *((volatile unsigned int*)(0x4266C14CUL))
#define bM0P_GPIO_FN_SEL02_TIOB2S0                      *((volatile unsigned int*)(0x4266C150UL))
#define bM0P_GPIO_FN_SEL02_TIOB2S1                      *((volatile unsigned int*)(0x4266C154UL))
#define bM0P_GPIO_FN_SEL02_TIOB2S2                      *((volatile unsigned int*)(0x4266C158UL))
#define bM0P_GPIO_FN_SEL02_TIOA3S0                      *((volatile unsigned int*)(0x4266C160UL))
#define bM0P_GPIO_FN_SEL02_TIOA3S1                      *((volatile unsigned int*)(0x4266C164UL))
#define bM0P_GPIO_FN_SEL02_TIOA3E0                      *((volatile unsigned int*)(0x4266C168UL))
#define bM0P_GPIO_FN_SEL02_TIOA3E1                      *((volatile unsigned int*)(0x4266C16CUL))
#define bM0P_GPIO_FN_SEL02_TIOB3S0                      *((volatile unsigned int*)(0x4266C170UL))
#define bM0P_GPIO_FN_SEL02_TIOB3S1                      *((volatile unsigned int*)(0x4266C174UL))
#define bM0P_GPIO_FN_SEL04_EINT00S0                     *((volatile unsigned int*)(0x4266C200UL))
#define bM0P_GPIO_FN_SEL04_EINT00S1                     *((volatile unsigned int*)(0x4266C204UL))
#define bM0P_GPIO_FN_SEL04_EINT01S0                     *((volatile unsigned int*)(0x4266C208UL))
#define bM0P_GPIO_FN_SEL04_EINT01S1                     *((volatile unsigned int*)(0x4266C20CUL))
#define bM0P_GPIO_FN_SEL04_EINT02S0                     *((volatile unsigned int*)(0x4266C210UL))
#define bM0P_GPIO_FN_SEL04_EINT02S1                     *((volatile unsigned int*)(0x4266C214UL))
#define bM0P_GPIO_FN_SEL04_EINT03S0                     *((volatile unsigned int*)(0x4266C218UL))
#define bM0P_GPIO_FN_SEL04_EINT03S1                     *((volatile unsigned int*)(0x4266C21CUL))
#define bM0P_GPIO_FN_SEL04_EINT04S0                     *((volatile unsigned int*)(0x4266C220UL))
#define bM0P_GPIO_FN_SEL04_EINT04S1                     *((volatile unsigned int*)(0x4266C224UL))
#define bM0P_GPIO_FN_SEL04_EINT05S0                     *((volatile unsigned int*)(0x4266C228UL))
#define bM0P_GPIO_FN_SEL04_EINT05S1                     *((volatile unsigned int*)(0x4266C22CUL))
#define bM0P_GPIO_FN_SEL04_EINT06S0                     *((volatile unsigned int*)(0x4266C230UL))
#define bM0P_GPIO_FN_SEL04_EINT06S1                     *((volatile unsigned int*)(0x4266C234UL))
#define bM0P_GPIO_FN_SEL04_EINT07S0                     *((volatile unsigned int*)(0x4266C238UL))
#define bM0P_GPIO_FN_SEL04_EINT07S1                     *((volatile unsigned int*)(0x4266C23CUL))
#define bM0P_GPIO_FN_SEL04_EINT08S0                     *((volatile unsigned int*)(0x4266C240UL))
#define bM0P_GPIO_FN_SEL04_EINT08S1                     *((volatile unsigned int*)(0x4266C244UL))
#define bM0P_GPIO_FN_SEL04_EINT09S0                     *((volatile unsigned int*)(0x4266C248UL))
#define bM0P_GPIO_FN_SEL04_EINT09S1                     *((volatile unsigned int*)(0x4266C24CUL))
#define bM0P_GPIO_FN_SEL04_EINT10S0                     *((volatile unsigned int*)(0x4266C250UL))
#define bM0P_GPIO_FN_SEL04_EINT10S1                     *((volatile unsigned int*)(0x4266C254UL))
#define bM0P_GPIO_FN_SEL04_EINT11S0                     *((volatile unsigned int*)(0x4266C258UL))
#define bM0P_GPIO_FN_SEL04_EINT11S1                     *((volatile unsigned int*)(0x4266C25CUL))
#define bM0P_GPIO_FN_SEL04_EINT12S0                     *((volatile unsigned int*)(0x4266C260UL))
#define bM0P_GPIO_FN_SEL04_EINT12S1                     *((volatile unsigned int*)(0x4266C264UL))
#define bM0P_GPIO_FN_SEL04_EINT13S0                     *((volatile unsigned int*)(0x4266C268UL))
#define bM0P_GPIO_FN_SEL04_EINT13S1                     *((volatile unsigned int*)(0x4266C26CUL))
#define bM0P_GPIO_FN_SEL04_EINT14S0                     *((volatile unsigned int*)(0x4266C270UL))
#define bM0P_GPIO_FN_SEL04_EINT14S1                     *((volatile unsigned int*)(0x4266C274UL))
#define bM0P_GPIO_FN_SEL04_EINT15S0                     *((volatile unsigned int*)(0x4266C278UL))
#define bM0P_GPIO_FN_SEL04_EINT15S1                     *((volatile unsigned int*)(0x4266C27CUL))
#define bM0P_GPIO_FN_SEL07_RTS4E0                       *((volatile unsigned int*)(0x4266C380UL))
#define bM0P_GPIO_FN_SEL07_RTS4E1                       *((volatile unsigned int*)(0x4266C384UL))
#define bM0P_GPIO_FN_SEL07_CTS4S0                       *((volatile unsigned int*)(0x4266C388UL))
#define bM0P_GPIO_FN_SEL07_CTS4S1                       *((volatile unsigned int*)(0x4266C38CUL))
#define bM0P_GPIO_FN_SEL07_SIN4S0                       *((volatile unsigned int*)(0x4266C390UL))
#define bM0P_GPIO_FN_SEL07_SIN4S1                       *((volatile unsigned int*)(0x4266C394UL))
#define bM0P_GPIO_FN_SEL07_SOT4B0                       *((volatile unsigned int*)(0x4266C398UL))
#define bM0P_GPIO_FN_SEL07_SOT4B1                       *((volatile unsigned int*)(0x4266C39CUL))
#define bM0P_GPIO_FN_SEL07_SCK4B0                       *((volatile unsigned int*)(0x4266C3A0UL))
#define bM0P_GPIO_FN_SEL07_SCK4B1                       *((volatile unsigned int*)(0x4266C3A4UL))
#define bM0P_GPIO_FN_SEL07_SCS40B0                      *((volatile unsigned int*)(0x4266C3A8UL))
#define bM0P_GPIO_FN_SEL07_SCS40B1                      *((volatile unsigned int*)(0x4266C3ACUL))
#define bM0P_GPIO_FN_SEL07_SCS41E0                      *((volatile unsigned int*)(0x4266C3B0UL))
#define bM0P_GPIO_FN_SEL07_SCS41E1                      *((volatile unsigned int*)(0x4266C3B4UL))
#define bM0P_GPIO_FN_SEL07_SIN5S0                       *((volatile unsigned int*)(0x4266C3D0UL))
#define bM0P_GPIO_FN_SEL07_SIN5S1                       *((volatile unsigned int*)(0x4266C3D4UL))
#define bM0P_GPIO_FN_SEL07_SOT5B0                       *((volatile unsigned int*)(0x4266C3D8UL))
